{
  "backend/main.mo": "Defines an actor exposing product data and query functions to fetch all products or a product by ID.",
  "feature_evidence.json": "Lists feature evidence mapping dark‑mode and image‑usage requirements to specific frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for key frontend files including hooks, components, styling, and config.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH color variables for light and dark mode, applying dark theme when class is active.",
  "frontend/index.html": "HTML entry point enabling dark mode by default and mounting the React app.",
  "frontend/src/App.tsx": "Main app composing hero, benefits, product cards, and product details with dark‑mode‑friendly assets and smooth scrolling.",
  "frontend/src/components/ProductCard.tsx": "Product card displaying an image, key details, benefits badges, and a learn‑more button with dark‑mode styling.",
  "frontend/src/components/ProductDetailsSection.tsx": "Full product detail section with large image, benefits, and a how‑to‑use accordion, styled for dark mode.",
  "frontend/src/components/TopNav.tsx": "Sticky top navigation with logo and buttons that scroll to product sections.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend canister actor, updating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, exposing identity state and login/logout helpers using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch product lists and individual products through an actor instance.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom CSS variables for a light/dark theme using OKLCH colors.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, radii, shadows, and animations, and enabling plugins.",
  "project_state.json": "Contains project metadata, current features, requirements, and thematic/visual constraints for the SW Professional app."
}