{
  "backend/main.mo": "Defines a Product type, a static list of three products, and exposes query methods to fetch all products or a product by ID.",
  "feature_evidence.json": "Contains feature evidence metadata mapping features to related source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries describing each frontend file’s purpose and functionality.",
  "frontend/index.css": "Sets global Tailwind base styles and defines a custom OKLCH color theme for light and dark modes.",
  "frontend/index.html": "Minimal HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React page assembling the hero, benefits, product cards, and detailed product sections using backend data and image assets.",
  "frontend/src/components/ProductCard.tsx": "Renders a product preview card with image, short details, benefit badges, and a Learn More button.",
  "frontend/src/components/ProductDetailsSection.tsx": "Displays a full product detail section with image, benefits, and an expandable how‑to‑use accordion.",
  "frontend/src/components/TopNav.tsx": "Sticky top navigation bar with brand logo and buttons that scroll to product sections.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and manages a backend actor instance, refreshing it when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context/provider and hook for managing Internet Identity authentication using AuthClient, including login, logout, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch product lists and individual products via an actor from the backend.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom OKLCH CSS variables for light and dark themes, applying global background and text settings.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, shadows, radii, and plugins like typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, feature definitions, requirements, and image asset needs for the SW PROFESSIONAL app."
}