{
  "kind": "build_request",
  "title": "Default the SW PROFESSIONAL site to a dark background while keeping provided images",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Make the SW PROFESSIONAL app render in dark mode by default (dark background) across the landing page, product overview cards, product detail sections, navigation, and footer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "IT SHOULD BE IN DARK BACKGROUND WITH THE PICTURES I HAVE SENT YOU"
        ]
      },
      "acceptanceCriteria": [
        "On first load (without any user action), the app uses the dark theme tokens (i.e., the .dark theme variables are active).",
        "All primary sections (hero overlay, benefits section, product cards, product details, TopNav, footer) have readable contrast on a dark background (no light-theme background bleeding through).",
        "No changes are made to any files under frontend/src/components/ui or other immutable paths."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Ensure the provided images are used throughout the UI (hero banner, brand logo, and three product images) and remain visually legible on the dark background (adjust overlays/containers if needed, without replacing the images).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "IT SHOULD BE IN DARK BACKGROUND WITH THE PICTURES I HAVE SENT YOU"
        ]
      },
      "acceptanceCriteria": [
        "Hero uses /assets/generated/sw-professional-hero.dim_1600x900.png and remains clearly visible with any necessary dark-mode overlay adjustments.",
        "Brand mark uses /assets/generated/sw-professional-logo.dim_512x512.png in TopNav and footer and remains visible on the dark background.",
        "Product images use the existing paths in App.tsx: /assets/generated/product-shampoo.dim_1024x1024.png, /assets/generated/product-hair-mask.dim_1024x1024.png, /assets/generated/product-hair-serum.dim_1024x1024.png, and remain visible in both ProductCard and ProductDetailsSection."
      ]
    }
  ],
  "constraints": [
    "Frontend must remain React + TypeScript + Tailwind + React Query.",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend remains single-actor (no new backend canisters/services)."
  ],
  "nonGoals": [
    "Creating or generating new images (use the already-provided/generated assets).",
    "Adding new products or changing the product catalog schema.",
    "Adding authentication changes or any Internet Identity flow changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}