{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Default SW PROFESSIONAL to dark theme while preserving provided images",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Default the SW PROFESSIONAL app to dark mode (dark background) across all primary sections without modifying immutable UI paths.",
      "acceptanceCriteria": [
        "On first load (without any user action), the app uses the dark theme tokens (i.e., the .dark theme variables are active).",
        "All primary sections (hero overlay, benefits section, product cards, product details, TopNav, footer) have readable contrast on a dark background (no light-theme background bleeding through).",
        "No changes are made to any files under frontend/src/components/ui or other immutable paths."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Set the app to render in dark mode by default by applying the \"dark\" class at the document root level so Tailwind's class-based dark mode and the existing .dark CSS variables are active on first load."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit and adjust landing page section wrappers and hero overlay classes to ensure consistent dark-background rendering (e.g., avoid any translucent light-background bleed-through) while keeping layout and existing data flow intact."
        },
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Tune navigation background/border opacity and text contrast classes for dark mode so the sticky header remains readable and visually consistent against the dark page background."
        },
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Adjust product card container/image-area styling to ensure readable contrast and cohesive dark-mode presentation while continuing to use the existing shadcn-based Card/Button/Badge components (do not edit frontend/src/components/ui)."
        },
        {
          "path": "frontend/src/components/ProductDetailsSection.tsx",
          "operation": "modify",
          "description": "Adjust product detail section container/image-area styling to ensure readable contrast (titles, descriptions, benefits, accordion content) on dark backgrounds, without changing any immutable shadcn/ui component sources."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Use the provided hero, logo, and product images throughout the UI and ensure they remain legible on the dark background via overlays/containers (without replacing images).",
      "acceptanceCriteria": [
        "Hero uses /assets/generated/sw-professional-hero.dim_1600x900.png and remains clearly visible with any necessary dark-mode overlay adjustments.",
        "Brand mark uses /assets/generated/sw-professional-logo.dim_512x512.png in TopNav and footer and remains visible on the dark background.",
        "Product images use the existing paths in App.tsx: /assets/generated/product-shampoo.dim_1024x1024.png, /assets/generated/product-hair-mask.dim_1024x1024.png, /assets/generated/product-hair-serum.dim_1024x1024.png, and remain visible in both ProductCard and ProductDetailsSection."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Keep image paths unchanged and explicitly ensure the hero uses frontend/public/assets/generated/sw-professional-hero.dim_1600x900.png and product image mapping continues to use frontend/public/assets/generated/product-shampoo.dim_1024x1024.png, frontend/public/assets/generated/product-hair-mask.dim_1024x1024.png, frontend/public/assets/generated/product-hair-serum.dim_1024x1024.png; adjust hero overlay/gradient strength as needed for legibility on dark mode without swapping assets."
        },
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Ensure the brand mark continues to use frontend/public/assets/generated/sw-professional-logo.dim_512x512.png and remains visible on dark backgrounds by adjusting its container/contrast (e.g., subtle backdrop, padding, or surface color behind the logo) without altering the image file."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the footer continues to use frontend/public/assets/generated/sw-professional-logo.dim_512x512.png and remains legible on dark mode by adjusting footer surface/spacing/contrast as needed, without changing the asset."
        },
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Ensure product images remain visually legible on dark mode by adjusting the image container styling (background surface, padding, rounded corners, or object-fit choice) while continuing to render the provided imageSrc (do not replace imageSrc values)."
        },
        {
          "path": "frontend/src/components/ProductDetailsSection.tsx",
          "operation": "modify",
          "description": "Ensure the product image in the details section remains visually legible on dark mode by adjusting the image container styling (background surface, padding, and/or object-fit choice) while continuing to render the provided imageSrc (no asset replacements)."
        }
      ]
    }
  ]
}